src/Catalogs/КомандыБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>КомандыБота</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>TelComand</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВопросов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТекстВопроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/КомандыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>КомандыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомандыБота</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>client_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>next_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>chat_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/КомандыБота/Ext/ManagerModule.bsl
Процедура ОбработатьКоманду(Команда, chat_id, client_id)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	КомандыПользователей.chat_id КАК chat_id,
		|	КомандыПользователей.Команда КАК Команда,
		|	КомандыПользователей.Выполнено КАК Выполнено,
		|	КомандыПользователей.ТекстСообщения КАК ТекстСообщения,
		|	КомандыПользователей.client_id КАК client_id,
		|	КомандыПользователей.date КАК date,
		|	КомандыПользователей.next_id КАК next_id,
		|	КомандыБотаСписокВопросов.Реквизит КАК Реквизит,
		|	КомандыПользователей.Команда.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.КомандыПользователей КАК КомандыПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КомандыБота.СписокВопросов КАК КомандыБотаСписокВопросов
		|		ПО КомандыПользователей.Команда = КомандыБотаСписокВопросов.Ссылка
		|			И КомандыПользователей.next_id = КомандыБотаСписокВопросов.НомерСтроки
		|ГДЕ
		|	КомандыПользователей.chat_id <= &chat_id
		|	И КомандыПользователей.client_id = &client_id
		|	И КомандыПользователей.Команда = &Команда
		|
		|УПОРЯДОЧИТЬ ПО
		|	chat_id УБЫВ";
	
	Запрос.УстановитьПараметр("chat_id", chat_id);
	Запрос.УстановитьПараметр("client_id", client_id);
	Запрос.УстановитьПараметр("Команда", Команда);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЗначениеРеквизитов = Новый Соответствие;
	ИмяОбъекта = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.next_id = 0 тогда
			ИмяОбъекта = ВыборкаДетальныеЗаписи.Документ;
			прервать
		конецесли;	
		ЗначениеРеквизитов.Вставить(ВыборкаДетальныеЗаписи.Реквизит, ВыборкаДетальныеЗаписи.ТекстСообщения);
				
	КонецЦикла;
	
	СоздатьОбъект(ИмяОбъекта, ЗначениеРеквизитов,client_id);
	
КонецПроцедуры


Процедура СоздатьОбъект(ИмяОбъекта, ЗначениеРеквизитов,client_id);
	
	НовыйОбъект = Неопределено;
	
	Если Найти(ИмяОбъекта, "Документ") Тогда
		Выполнить("НовыйОбъект = " + ИмяОбъекта + ".СоздатьДокумент()");
		НовыйОбъект.Дата = ТекущаяДата();
		НовыйОбъект.Клиент = НайтиКлиентаПоИД(client_id);
		НовыйОбъект.Статус = Перечисления.СтатусыЗаказов.Принят;
	Иначе
		Выполнить("НовыйОбъект = " + ИмяОбъекта + ".СоздатьЭлемент()");
		НовыйОбъект.client_id = client_id;
	КонецЕсли;
	
		
	Для Каждого ЗначениеР Из ЗначениеРеквизитов Цикл
		Если ТипЗнч(НовыйОбъект[ЗначениеР.Ключ]) <> ТипЗнч(ЗначениеР.Значение) тогда
			втЗначение = СоздатьСправочник(ЗначениеР.Ключ,ЗначениеР.Значение,client_id);
			Выполнить("НовыйОбъект." + ЗначениеР.Ключ + " = втЗначение");
		иначе
			Выполнить("НовыйОбъект." + ЗначениеР.Ключ + " = """ + ЗначениеР.Значение + """");
		конецесли;	
		
		
	КонецЦикла;
	
	Если Найти(ИмяОбъекта, "Документ") Тогда
		НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	иначе
		НовыйОбъект.Записать();
	конецесли;
	                                               
КонецПроцедуры

Функция НайтиКлиентаПоИД(client_id)
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |ГДЕ
	               |	Клиенты.client_id = &client_id";
	запрос.УстановитьПараметр("client_id",client_id);
	выборка = запрос.Выполнить().Выбрать();
	выборка.Следующий();
	возврат выборка.ссылка
конецфункции	

Функция СоздатьСправочник(Имя,Значение,client_id)
	Поиск = Справочники[Имя+"ы"].НайтиПоНаименованию(Значение);
	Если ЗначениеЗаполнено(Поиск) тогда
		возврат Поиск
	иначе
		НовыйСпр = Справочники[Имя+"ы"].СоздатьЭлемент();
		НовыйСпр.Наименование = Значение;
		НовыйСпр.client_id = client_id;
		НовыйСпр.Записать();
		возврат НовыйСпр.ссылка 
	конецесли;	
конецфункции
